//=============================================================================
//
// ライフ描画処理 [bosslife.h]
//  Author : HALゲーム学科二年生課程1年　山本壮将
//
//=============================================================================
#ifndef _BOSSLIFE_H_
#define _BOSSLIFE_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBosslife(void);
void UninitBosslife(void);
void UpdateBosslife(void);
void DrawBosslife(void);



#endif
