//=============================================================================
//
// ライフ描画処理 [enemyinfo.h]
//  Author : HALゲーム学科二年生課程1年　山本壮将
//
//=============================================================================
#ifndef _LENEMYINFO_H_
#define _LENEMYINFO_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitEnemyinfo(void);
void UninitEnemyinfo(void);
void UpdateEnemyinfo(void);
void DrawEnemyinfo(void);



#endif
