//*****************************************************************************************************
// ファイル名:	model_longcheck.h
// 作成日:		1月22日
// 説明:		ゲーム内モデルの長さを決める
//*****************************************************************************************************
#ifndef _MODEL_LONGCHECK_H_
#define _MODEL_LONGCHECK_H_

//*****************************************************************************************************
// インクルードファイル
//*****************************************************************************************************
#include "main.h"

//*****************************************************************************************************
// マクロ定義
//*****************************************************************************************************

//*****************************************************************************************************
// 構造体定義
//*****************************************************************************************************

// 利用する半径を保存
typedef struct
{
	float	modelhighlength;
	float	modelsidelength;
	float	modelcenterlength;
}MODELLENGTH;

// メッシュたち保管
typedef struct
{
	LPD3DXBUFFER	BuffMatCheck;		// マテリアルデータを含むバッファへのポインタ
	DWORD			NumMatCheck;		// D3DXMATERIAL構造体へのポインタ
	LPD3DXMESH		MeshModelCheck;		// レイピックで使うのはこれ
	BOOL			hitcheck;			// レイが測定用ポリゴンへ当たっているかの確認用
	float			Getlong;			// 判定用ポリゴンへの長さ

}MODELCHECK;


// 読み込む測定用板ポリゴン
typedef enum
{
	MODELCENTERCHECK,
	MODELHIGHERCHECK,
	ENEMYLENGTHCHECK,
	CHECKMODEL_MAX
};

//*****************************************************************************************************
// プロトタイプ宣言
//*****************************************************************************************************
void checkmodellong(void);

#endif