//=============================================================================
//
// ライフ描画処理 [modellife.h]
//  Author : HALゲーム学科二年生課程1年　山本壮将
//
//=============================================================================
#ifndef _LMODELLIFE_H_
#define _LMODELLIFE_H_

#include "main.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************

// ライフゲージの枠
#define	LIFEWAKU_POS_X		(20)		// ライフゲージの枠の位置(X座標)
#define	LIFEWAKU_POS_Y		(20)		// ライフゲージの枠の位置(Y座標)
#define	LIFEWAKU_WIDTH		(500)		// ライフゲージの枠の幅
#define	LIFEWAKU_HEIGHT		(80)		// ライフゲージの枠の高さ

// ライフを表すゲージ
#define	HPGAGE_POS_X				(30)		// ライフゲージの位置(X座標)
#define	HPGAGE_POS_Y				(30)		// ライフゲージの位置(Y座標)
#define	HPGAGE_WIDTH				(470)		// ライフゲージの幅
#define	HPGAGE_HEIGHT			(20)		// ライフゲージの高さ

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitModellife(void);
void UninitModellife(void);
void UpdateModellife(void);
void DrawModellife(void);



#endif
