//=============================================================================
//
// スコア処理 [resultscore.h]
// Author : 
//
//=============================================================================
#ifndef _RESULTSCORE_H_
#define _RESULTSCORE_H_

#include "main.h"

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	int score;
}RESULTSCORE;


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitResultscore(void);
void UninitResultscore(void);
void UpdateResultscore(void);
void DrawResultscore(void);

void ChangeResultscore(int value);

#endif
