//=============================================================================
//
// ライフ描画処理 [titlelogo.h]
//  Author : HALゲーム学科二年生課程1年　山本壮将
//
//=============================================================================
#ifndef _TITLELOGO_H_
#define _TITLELOGO_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitlelogo(void);
void UninitTitlelogo(void);
void UpdateTitlelogo(void);
void DrawTitlelogo(void);



#endif
